Revit 2024 API
FaceNode.GetFace Method
 Returns the Face object corresponding to the node.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public Face GetFace()
Visual Basic
Public Function GetFace As Face
Visual C++
public:
Face^ GetFace()
Return Value
 The face.
See Also
FaceNode Class
Autodesk.Revit.DB Namespace